DNNPlatform/DesktopModules/NBright/OS_Chronopost2/soaplabel.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cxf="http://cxf.shipping.soap.chronopost.fr/">
   <soapenv:Header/>
   <soapenv:Body>
      <cxf:shippingWithReservationAndESDWithRefClient>
         <esdValue>
				<closingDateTime></closingDateTime>
				<height>0.0</height>
				<length>0.0</length>
				<retrievalDateTime></retrievalDateTime>
				<shipperBuildingFloor></shipperBuildingFloor>
				<shipperCarriesCode></shipperCarriesCode>
				<shipperServiceDirection></shipperServiceDirection>
				<specificInstructions></specificInstructions>
            <width>0.0</width>
            <ltAImprimerParChronopost>0</ltAImprimerParChronopost>
            <nombreDePassageMaximum>0</nombreDePassageMaximum>
               <refEsdClient></refEsdClient>
         </esdValue>
         <headerValue>
            <accountNumber>{accountNumber}</accountNumber>
               <idEmit>CHRFR</idEmit>
               <identWebPro></identWebPro>
            <subAccount></subAccount>
         </headerValue>
         <shipperValue>
               <shipperAdress1>{storeaddressline1}</shipperAdress1>
               <shipperAdress2>{storeaddressline2}</shipperAdress2>
               <shipperCity>{storecity}</shipperCity>
               <shipperCivility>M</shipperCivility>
               <shipperContactName>{storeattention}</shipperContactName>
               <shipperCountry>{shipperCountry}</shipperCountry>
               <shipperCountryName>{shipperCountryName}</shipperCountryName>
               <shipperEmail>{supportemail}</shipperEmail>
               <shipperMobilePhone></shipperMobilePhone>
               <shipperName>{storename}</shipperName>
               <shipperName2>{storecompany}</shipperName2>
               <shipperPhone>{storephone}</shipperPhone>
				<shipperPreAlert></shipperPreAlert>
               <shipperZipCode>{storepostcode}</shipperZipCode>
         </shipperValue>
         <customerValue>
               <customerAdress1></customerAdress1>
               <customerAdress2></customerAdress2>
               <customerCity></customerCity>
               <customerCivility>M</customerCivility>
               <customerContactName></customerContactName>
               <customerCountry>FR</customerCountry>
               <customerCountryName></customerCountryName>
               <customerEmail></customerEmail>
               <customerMobilePhone></customerMobilePhone>
               <customerName></customerName>
               <customerName2></customerName2>
               <customerPhone></customerPhone>
            <customerPreAlert></customerPreAlert>
               <customerZipCode></customerZipCode>
               <printAsSender></printAsSender>
         </customerValue>
         <recipientValue>
               <recipientAdress1>{unit}</recipientAdress1>
               <recipientAdress2>{street}</recipientAdress2>
               <recipientCity>{city}</recipientCity>
               <recipientContactName>{firstname} {lastname}</recipientContactName>
               <recipientCountry>{country}</recipientCountry>
               <recipientCountryName>{countrytext}</recipientCountryName>
               <recipientEmail>{email}</recipientEmail>
               <recipientMobilePhone></recipientMobilePhone>
               <recipientName>{recfirstname}</recipientName>
               <recipientName2>{reclastname}</recipientName2>
               <recipientPhone>{telephone}</recipientPhone>
			   <recipientPreAlert>0</recipientPreAlert>
               <recipientZipCode>{postalcode}</recipientZipCode>
         </recipientValue>
         <refValue>
               <customerSkybillNumber></customerSkybillNumber>
               <PCardTransactionNumber></PCardTransactionNumber>
               <recipientRef>{recipientref}</recipientRef>
               <shipperRef>{ordernumber}</shipperRef>
         </refValue>
         <skybillValue>
               <bulkNumber></bulkNumber>
               <codCurrency></codCurrency>
               <codValue></codValue>
               <content1></content1>
               <content2></content2>
               <content3></content3>
               <content4></content4>
               <content5></content5>
               <customsCurrency></customsCurrency>
               <customsValue></customsValue>
               <evtCode>DC</evtCode>
               <insuredCurrency></insuredCurrency>
               <insuredValue></insuredValue>
               <objectType>{objecttype}</objectType>
               <portCurrency></portCurrency>
               <portValue></portValue>
               <productCode>{productcode}</productCode>
               <service>0</service>
               <shipDate>{shippingdate}</shipDate>
            <shipHour>12</shipHour>
               <skybillRank></skybillRank>
               <weight>{weight}</weight>
               <weightUnit>KGM</weightUnit>
         </skybillValue>
         <skybillParamsValue>
               <mode>{mode}</mode>
         </skybillParamsValue>
         <password>{password}</password>
         <modeRetour>2</modeRetour>
      </cxf:shippingWithReservationAndESDWithRefClient>
   </soapenv:Body>
</soapenv:Envelope>